Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff
er apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/6eacf9acdf0889d247b7511f6e69fef6e1c2148c8f9bf69b6adbc38256cdf9da.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.lambda-data-portal.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "5442942133503030757" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/8b995715bed619127af225162fa41c6ab590d7106660b2cd1433090d69e57e4e.zip" -> "builds/6eacf9acdf0889d247b7511f6e69fef6e1c2148c8f9bf69b6adbc38256cdf9da.zip"
          ~ "timestamp" = "1758684131369050000" -> "1758697918153141000"
        }
    }

  # module.sbeacon.module.lambda-data-portal.null_resource.archive[0] (deposed object bc96dc5b) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "8834388157378025420" -> null
      - triggers = {
          - "filename"  = "builds/bcea1c27fc757fe336baa8041c5aaa06890e646261ca6a8ac7edec780397b3d9.zip"
          - "timestamp" = "1756361685545796000"
        } -> null
    }

  # module.sbeacon.module.lambda-deidentifyFiles.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-deidentifyFiles"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_python_libraries_layer:11",
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_python_modules_layer:12",
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_binaries_layer:10",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-deidentifyFiles.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "2557400654686965698" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758684131443703800" -> "1758697918377403000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-generateCohortVCfs.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-generateCohortVCfs"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_python_libraries_layer:11",
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_python_modules_layer:12",
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_binaries_layer:10",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-generateCohortVCfs.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "4719083154613324898" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758684130584657000" -> "1758697918757797000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-generateCohortVCfs.null_resource.archive[0] (deposed object ffc3d007) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "8679099795194237193" -> null
      - triggers = {
          - "filename"  = "builds/2fed43367c56d0422d0098b15003d4ff9ae27cf689d7cfee7a7a5289345d6cc6.zip"
          - "timestamp" = "1756361686325505000"
        } -> null
    }

  # module.sbeacon.module.lambda-generateReports.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "2321140713813288273" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758684131259977200" -> "1758697918651484000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-generateReports.null_resource.archive[0] (deposed object d69b086c) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "2562498899717370028" -> null
      - triggers = {
          - "filename"  = "builds/0300e75b7f536502cf4a1de5308dcfa7fc3b7756791a2ad0c7579e34a8fcf036.zip"
          - "timestamp" = "1756361684633147000"
        } -> null
    }

  # module.sbeacon.module.lambda-getAnalyses.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getAnalyses"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_python_libraries_layer:11",
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_python_modules_layer:12",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getAnalyses.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "5873081317518123587" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758684131529710000" -> "1758697917494274000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getAnalyses.null_resource.archive[0] (deposed object 5842cdc8) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "4411304211523771186" -> null
      - triggers = {
          - "filename"  = "builds/a7bd83ed0d8a536495679c588b7db329d03eb49388aab75337bf8432251682e3.zip"
          - "timestamp" = "1756361685476478000"
        } -> null
    }

  # module.sbeacon.module.lambda-getBiosamples.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getBiosamples"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_python_libraries_layer:11",
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_python_modules_layer:12",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getBiosamples.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "876234018569185382" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758684130526024200" -> "1758697917268812800"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getBiosamples.null_resource.archive[0] (deposed object 95e747c7) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "3854390604748897433" -> null
      - triggers = {
          - "filename"  = "builds/45d2eecf1b7259072f636aa61cf33b646d8982a40e93a0231fa59ad8592f3066.zip"
          - "timestamp" = "1756361686461677000"
        } -> null
    }

  # module.sbeacon.module.lambda-getConfiguration.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getConfiguration"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_python_libraries_layer:11",
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_python_modules_layer:12",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getConfiguration.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "6387974969390876131" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758684131270694000" -> "1758697917694670000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getConfiguration.null_resource.archive[0] (deposed object 306bc8fb) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "4489911272184360146" -> null
      - triggers = {
          - "filename"  = "builds/bdfd549747da6fdfb5247f317d63fae8452b23a25d28d2bec5c967ba3341d016.zip"
          - "timestamp" = "1756361685146590000"
        } -> null
    }

  # module.sbeacon.module.lambda-getDatasets.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/f78997bb9bc0dea380d8498a4b2d3a671780471d2abe725a7a99d2839c679c9f.zip" -> "builds/ba2b020435be85158651dc18603aae7933577ef9299b1bcc392d86a7e39cf930.zip"
        id                             = "sbeacon-backend-getDatasets"
      ~ last_modified                  = "2025-09-24T04:25:46.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_python_libraries_layer:11",
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_python_modules_layer:12",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getDatasets.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/lambda/getDatasets",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/ba2b020435be85158651dc18603aae7933577ef9299b1bcc392d86a7e39cf930.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/ba2b020435be85158651dc18603aae7933577ef9299b1bcc392d86a7e39cf930.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.lambda-getDatasets.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "8192624801632281138" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/f78997bb9bc0dea380d8498a4b2d3a671780471d2abe725a7a99d2839c679c9f.zip" -> "builds/ba2b020435be85158651dc18603aae7933577ef9299b1bcc392d86a7e39cf930.zip"
          ~ "timestamp" = "1758684131175426000" -> "1758697917605397000"
        }
    }

  # module.sbeacon.module.lambda-getDatasets.null_resource.archive[0] (deposed object 823f1c84) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "3709252823014795725" -> null
      - triggers = {
          - "filename"  = "builds/8889d98b332ff2c345abce7901cc08df06679e2d8832131525ac9cd4b3a37923.zip"
          - "timestamp" = "1756361685322164000"
        } -> null
    }

  # module.sbeacon.module.lambda-getEntryTypes.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getEntryTypes"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_python_libraries_layer:11",
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_python_modules_layer:12",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getEntryTypes.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "5204955828455974896" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758684131733932000" -> "1758697917443062000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getEntryTypes.null_resource.archive[0] (deposed object 0ab9b7a3) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "5435797285187752400" -> null
      - triggers = {
          - "filename"  = "builds/238c996d7bde89f739f1e7095110c69c47ce7589b588b35ea1f94beaf9b14210.zip"
          - "timestamp" = "1756361684784588000"
        } -> null
    }

  # module.sbeacon.module.lambda-getFilteringTerms.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getFilteringTerms"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_python_libraries_layer:11",
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_python_modules_layer:12",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getFilteringTerms.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "7162066190593867551" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758684131558817000" -> "1758697917953182000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getFilteringTerms.null_resource.archive[0] (deposed object c59aefc6) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "7921723634507485134" -> null
      - triggers = {
          - "filename"  = "builds/454b6d5e06b61167a7515cba40e977ff31c8f2db728e6c419afec860c13d5c85.zip"
          - "timestamp" = "1756361686348923000"
        } -> null
    }

  # module.sbeacon.module.lambda-getGenomicVariants.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getGenomicVariants"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_python_libraries_layer:11",
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_python_modules_layer:12",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getGenomicVariants.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "9004927497534639070" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758684130651161000" -> "1758697919184671000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getGenomicVariants.null_resource.archive[0] (deposed object ae17ff21) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "2599792936418979390" -> null
      - triggers = {
          - "filename"  = "builds/03cd2c3a98ebceb946ba1918b071fc2ed8a8e44431aa9ceb30659f6b1a23bb97.zip"
          - "timestamp" = "1756361686244651000"
        } -> null
    }

  # module.sbeacon.module.lambda-getIndividuals.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getIndividuals"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_python_libraries_layer:11",
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_python_modules_layer:12",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "4089645665775942582" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758684131072338200" -> "1758697917862315000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0] (deposed object 78e8c812) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "4365572537370490299" -> null
      - triggers = {
          - "filename"  = "builds/54d135633142b071ec455b6045d8f1cbc9c559b03c00a6311b967298b458ab40.zip"
          - "timestamp" = "1756361685152890000"
        } -> null
    }

  # module.sbeacon.module.lambda-getInfo.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getInfo"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_python_libraries_layer:11",
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_python_modules_layer:12",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getInfo.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "7943775409500419965" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758684130453241200" -> "1758697918787760000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getInfo.null_resource.archive[0] (deposed object 6b45aa02) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "6519887017874188612" -> null
      - triggers = {
          - "filename"  = "builds/549ea2149ce3f8600d7817b5ad724fa92298664f34913190d9d5c78566719e70.zip"
          - "timestamp" = "1756361686438827000"
        } -> null
    }

  # module.sbeacon.module.lambda-getMap.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getMap"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_python_libraries_layer:11",
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_python_modules_layer:12",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getMap.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "8421201964694454956" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758684130936346000" -> "1758697917455906000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getMap.null_resource.archive[0] (deposed object a6637518) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "6970988915221700121" -> null
      - triggers = {
          - "filename"  = "builds/6e74e5347aeb09443a9bcfb7a1b7f282d19c03509066e7bd1bfa6ff3d1787540.zip"
          - "timestamp" = "1756361686055661000"
        } -> null
    }

  # module.sbeacon.module.lambda-getProjects.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getProjects"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_python_libraries_layer:11",
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_python_modules_layer:12",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getProjects.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "7247448600542824079" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758684132425541000" -> "1758697918775154200"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getProjects.null_resource.archive[0] (deposed object 6d706726) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "5424087072040764126" -> null
      - triggers = {
          - "filename"  = "builds/aa396856c56bc316f5429db8c17f42525a5333058192b85978c8cc8f4bb30bfe.zip"
          - "timestamp" = "1756361686528891000"
        } -> null
    }

  # module.sbeacon.module.lambda-getRuns.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getRuns"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_python_libraries_layer:11",
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_python_modules_layer:12",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getRuns.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "4273343203942095451" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758684130275082200" -> "1758697917660515000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getRuns.null_resource.archive[0] (deposed object 30aa5d3d) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "4758730622726386871" -> null
      - triggers = {
          - "filename"  = "builds/88930b272de54490182522f38fc6eadca926dd71de4ff726cf3de04349617ecc.zip"
          - "timestamp" = "1756361685058708000"
        } -> null
    }

  # module.sbeacon.module.lambda-indexer.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-indexer"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_python_libraries_layer:11",
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_python_modules_layer:12",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-indexer.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "4131027816613851587" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758684131355364000" -> "1758697918595159000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-indexer.null_resource.archive[0] (deposed object 96598cee) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "6598910247845622208" -> null
      - triggers = {
          - "filename"  = "builds/aa624c03dfdae7cc1b6f9061e4ad7e5605e073652e2540f56756ee4171caf5db.zip"
          - "timestamp" = "1756361686448275000"
        } -> null
    }

  # module.sbeacon.module.lambda-performQuery.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-performQuery"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_binaries_layer:10",
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_python_libraries_layer:11",
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_python_modules_layer:12",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-performQuery.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "6433035372647175671" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758684130760917000" -> "1758697919272788000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-performQuery.null_resource.archive[0] (deposed object 97f33045) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "7205706735813425468" -> null
      - triggers = {
          - "filename"  = "builds/ed9c4d15f50553a43a1fbe829043aee893846f7ad048b424e36c5ecf460120d1.zip"
          - "timestamp" = "1756361684976816000"
        } -> null
    }

  # module.sbeacon.module.lambda-splitQuery.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-splitQuery"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_python_libraries_layer:11",
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_python_modules_layer:12",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-splitQuery.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "4231561358028726172" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758684130851384000" -> "1758697918696785000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-splitQuery.null_resource.archive[0] (deposed object 4845e040) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "5955086644095798345" -> null
      - triggers = {
          - "filename"  = "builds/76408ab6569b18b2349025a9480461ae075f7db9418cd088256937bb57a8a8ac.zip"
          - "timestamp" = "1756361686078704200"
        } -> null
    }

  # module.sbeacon.module.lambda-updateFiles.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-updateFiles"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_binaries_layer:10",
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_python_libraries_layer:11",
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_python_modules_layer:12",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-updateFiles.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "7224336396574488078" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758684130348312000" -> "1758697918859785000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.python_libraries_layer.aws_lambda_layer_version.this[0] must be replaced
+/- resource "aws_lambda_layer_version" "this" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_python_libraries_layer:11" -> (known after apply)
      ~ code_sha256                 = "4XL2O58nZ8wMcMmwcJpnMtBHiKAlP55EbSOeWAvNVkI=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2025-09-24T04:24:15.875+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_python_libraries_layer:11" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_python_libraries_layer" -> (known after apply)
      ~ s3_key                      = "builds/bd79faeab2d57258b837d8e3cdc705c4157d90126dce928184d7c10dd47d2e15.zip" -> "builds/294c271a12e0e70eadfd44e555d3d690cbe01684b1df86d74ce6d3febde5ffe6.zip" # forces replacement
      + s3_object_version           = (known after apply) # forces replacement
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + source_code_hash            = (known after apply)
      ~ source_code_size            = 24398175 -> (known after apply)
      ~ version                     = "11" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_libraries_layer.aws_lambda_layer_version.this[0] (deposed object 8d07617e) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "aws_lambda_layer_version" "this" {
      - arn                         = "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_python_libraries_layer:10" -> null
      - code_sha256                 = "GEYgVtHKiar30PjI8pMgt+P9r+n+au2PphVA3bfWRBE=" -> null
      - compatible_architectures    = [] -> null
      - compatible_runtimes         = [
          - "python3.12",
        ] -> null
      - created_date                = "2025-08-28T06:18:18.176+0000" -> null
      - description                 = "python libraries" -> null
      - id                          = "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_python_libraries_layer:10" -> null
      - layer_arn                   = "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_python_libraries_layer" -> null
      - layer_name                  = "sbeacon_backend_python_libraries_layer" -> null
      - region                      = "ap-southeast-3" -> null
      - s3_bucket                   = "gaspi-lambda-layers20250519061959773600000003" -> null
      - s3_key                      = "builds/038b6afd1b996bd50fc7bf401c90990f7f8da8fb0515f1754075775ae16fe3f3.zip" -> null
      - skip_destroy                = false -> null
      - source_code_size            = 24399227 -> null
      - version                     = "10" -> null
        # (5 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_libraries_layer.aws_s3_object.lambda_package[0] must be replaced
+/- resource "aws_s3_object" "lambda_package" {
      ~ arn                           = "arn:aws:s3:::gaspi-lambda-layers20250519061959773600000003/builds/bd79faeab2d57258b837d8e3cdc705c4157d90126dce928184d7c10dd47d2e15.zip" -> (known after apply)
      ~ bucket_key_enabled            = false -> (known after apply)
      + checksum_crc32                = (known after apply)
      + checksum_crc32c               = (known after apply)
      + checksum_crc64nvme            = (known after apply)
      + checksum_sha1                 = (known after apply)
      + checksum_sha256               = (known after apply)
      ~ content_type                  = "binary/octet-stream" -> (known after apply)
      ~ etag                          = "a6f025f4ee17ac52a143cd79effb2fa6-5" -> (known after apply)
      ~ id                            = "gaspi-lambda-layers20250519061959773600000003/builds/bd79faeab2d57258b837d8e3cdc705c4157d90126dce928184d7c10dd47d2e15.zip" -> (known after apply)
      ~ key                           = "builds/bd79faeab2d57258b837d8e3cdc705c4157d90126dce928184d7c10dd47d2e15.zip" -> "builds/294c271a12e0e70eadfd44e555d3d690cbe01684b1df86d74ce6d3febde5ffe6.zip" # forces replacement
      + kms_key_id                    = (known after apply)
      - metadata                      = {} -> null
      ~ server_side_encryption        = "AES256" -> (known after apply)
      ~ source                        = "builds/bd79faeab2d57258b837d8e3cdc705c4157d90126dce928184d7c10dd47d2e15.zip" -> "builds/294c271a12e0e70eadfd44e555d3d690cbe01684b1df86d74ce6d3febde5ffe6.zip"
      - tags                          = {} -> null
      + version_id                    = (known after apply)
        # (14 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_libraries_layer.aws_s3_object.lambda_package[0] (deposed object d0bc174b) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "aws_s3_object" "lambda_package" {
      - acl                           = "private" -> null
      - arn                           = "arn:aws:s3:::gaspi-lambda-layers20250519061959773600000003/builds/038b6afd1b996bd50fc7bf401c90990f7f8da8fb0515f1754075775ae16fe3f3.zip" -> null
      - bucket                        = "gaspi-lambda-layers20250519061959773600000003" -> null
      - bucket_key_enabled            = false -> null
      - content_type                  = "binary/octet-stream" -> null
      - etag                          = "845ef64a9fa65edd46ad048973fa2087-5" -> null
      - force_destroy                 = false -> null
      - id                            = "gaspi-lambda-layers20250519061959773600000003/builds/038b6afd1b996bd50fc7bf401c90990f7f8da8fb0515f1754075775ae16fe3f3.zip" -> null
      - key                           = "builds/038b6afd1b996bd50fc7bf401c90990f7f8da8fb0515f1754075775ae16fe3f3.zip" -> null
      - metadata                      = {} -> null
      - region                        = "ap-southeast-3" -> null
      - server_side_encryption        = "AES256" -> null
      - source                        = "builds/038b6afd1b996bd50fc7bf401c90990f7f8da8fb0515f1754075775ae16fe3f3.zip" -> null
      - storage_class                 = "ONEZONE_IA" -> null
      - tags                          = {} -> null
      - tags_all                      = {
          - "Environment" = "uat"
          - "NAME"        = "sbeacon-backend"
          - "Owner"       = "gaspi"
        } -> null
        # (14 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_libraries_layer.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/layers/python_libraries/",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/294c271a12e0e70eadfd44e555d3d690cbe01684b1df86d74ce6d3febde5ffe6.zip"
              + runtime       = ""
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/294c271a12e0e70eadfd44e555d3d690cbe01684b1df86d74ce6d3febde5ffe6.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.python_libraries_layer.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "3845033191220101958" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/bd79faeab2d57258b837d8e3cdc705c4157d90126dce928184d7c10dd47d2e15.zip" -> "builds/294c271a12e0e70eadfd44e555d3d690cbe01684b1df86d74ce6d3febde5ffe6.zip"
          ~ "timestamp" = "1758687672743285800" -> "1758697924902564000"
        }
    }

  # module.sbeacon.module.python_libraries_layer.null_resource.archive[0] (deposed object 35c0b7c3) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "4273068299202009682" -> null
      - triggers = {
          - "filename"  = "builds/038b6afd1b996bd50fc7bf401c90990f7f8da8fb0515f1754075775ae16fe3f3.zip"
          - "timestamp" = "1756361702249567000"
        } -> null
    }

  # module.sbeacon.module.python_libraries_layer.null_resource.archive[0] (deposed object 84360f5d) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "1656840544843346760" -> null
      - triggers = {
          - "filename"  = "builds/5ebdb3e93394b6baf0c46bc3de1f053808891fcb8737fe769e1a1cbce77bc296.zip"
          - "timestamp" = "1758684143777912000"
        } -> null
    }

  # module.sbeacon.module.python_modules_layer.aws_lambda_layer_version.this[0] must be replaced
+/- resource "aws_lambda_layer_version" "this" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_python_modules_layer:12" -> (known after apply)
      ~ code_sha256                 = "iUPA0d1bJ+b13VhBT0wCSHyJMS7eodyY15VLOBhXS6k=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2025-09-24T03:25:29.968+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_python_modules_layer:12" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_python_modules_layer" -> (known after apply)
      ~ s3_key                      = "builds/9c3c8e0d842f528839ef05201bf321cd86234985f1f4f3162e7b5b3afcbc83c6.zip" -> "builds/b543027660ad53ae52d1e355a7d853e848201fe0fbf885fd5645831d03449398.zip" # forces replacement
      + s3_object_version           = (known after apply) # forces replacement
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + source_code_hash            = (known after apply)
      ~ source_code_size            = 120512 -> (known after apply)
      ~ version                     = "12" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_modules_layer.aws_lambda_layer_version.this[0] (deposed object 80f27cbf) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "aws_lambda_layer_version" "this" {
      - arn                         = "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_python_modules_layer:11" -> null
      - code_sha256                 = "kDqg5VT3RgExva9aDo0IBXb21rox9U6O24m9TFenIPY=" -> null
      - compatible_architectures    = [] -> null
      - compatible_runtimes         = [
          - "python3.12",
        ] -> null
      - created_date                = "2025-08-28T06:18:04.781+0000" -> null
      - description                 = "python libraries" -> null
      - id                          = "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_python_modules_layer:11" -> null
      - layer_arn                   = "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_python_modules_layer" -> null
      - layer_name                  = "sbeacon_backend_python_modules_layer" -> null
      - region                      = "ap-southeast-3" -> null
      - s3_bucket                   = "gaspi-lambda-layers20250519061959773600000003" -> null
      - s3_key                      = "builds/c3f360141f7543f284da3a1da75bf6ad42db5e5b3c29ca337dcb26bf204a7abd.zip" -> null
      - skip_destroy                = false -> null
      - source_code_size            = 120546 -> null
      - version                     = "11" -> null
        # (5 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_modules_layer.aws_s3_object.lambda_package[0] must be replaced
+/- resource "aws_s3_object" "lambda_package" {
      ~ arn                           = "arn:aws:s3:::gaspi-lambda-layers20250519061959773600000003/builds/9c3c8e0d842f528839ef05201bf321cd86234985f1f4f3162e7b5b3afcbc83c6.zip" -> (known after apply)
      ~ bucket_key_enabled            = false -> (known after apply)
      + checksum_crc32                = (known after apply)
      + checksum_crc32c               = (known after apply)
      + checksum_crc64nvme            = (known after apply)
      + checksum_sha1                 = (known after apply)
      + checksum_sha256               = (known after apply)
      ~ content_type                  = "application/octet-stream" -> (known after apply)
      ~ etag                          = "6a86bf84eea2cf2fa635920cab1effe3" -> (known after apply)
      ~ id                            = "gaspi-lambda-layers20250519061959773600000003/builds/9c3c8e0d842f528839ef05201bf321cd86234985f1f4f3162e7b5b3afcbc83c6.zip" -> (known after apply)
      ~ key                           = "builds/9c3c8e0d842f528839ef05201bf321cd86234985f1f4f3162e7b5b3afcbc83c6.zip" -> "builds/b543027660ad53ae52d1e355a7d853e848201fe0fbf885fd5645831d03449398.zip" # forces replacement
      + kms_key_id                    = (known after apply)
      - metadata                      = {} -> null
      ~ server_side_encryption        = "AES256" -> (known after apply)
      ~ source                        = "builds/9c3c8e0d842f528839ef05201bf321cd86234985f1f4f3162e7b5b3afcbc83c6.zip" -> "builds/b543027660ad53ae52d1e355a7d853e848201fe0fbf885fd5645831d03449398.zip"
      - tags                          = {} -> null
      + version_id                    = (known after apply)
        # (14 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_modules_layer.aws_s3_object.lambda_package[0] (deposed object e090c026) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "aws_s3_object" "lambda_package" {
      - acl                           = "private" -> null
      - arn                           = "arn:aws:s3:::gaspi-lambda-layers20250519061959773600000003/builds/c3f360141f7543f284da3a1da75bf6ad42db5e5b3c29ca337dcb26bf204a7abd.zip" -> null
      - bucket                        = "gaspi-lambda-layers20250519061959773600000003" -> null
      - bucket_key_enabled            = false -> null
      - content_type                  = "application/octet-stream" -> null
      - etag                          = "ae66c157da1309f2295eeff636660487" -> null
      - force_destroy                 = false -> null
      - id                            = "gaspi-lambda-layers20250519061959773600000003/builds/c3f360141f7543f284da3a1da75bf6ad42db5e5b3c29ca337dcb26bf204a7abd.zip" -> null
      - key                           = "builds/c3f360141f7543f284da3a1da75bf6ad42db5e5b3c29ca337dcb26bf204a7abd.zip" -> null
      - metadata                      = {} -> null
      - region                        = "ap-southeast-3" -> null
      - server_side_encryption        = "AES256" -> null
      - source                        = "builds/c3f360141f7543f284da3a1da75bf6ad42db5e5b3c29ca337dcb26bf204a7abd.zip" -> null
      - storage_class                 = "ONEZONE_IA" -> null
      - tags                          = {} -> null
      - tags_all                      = {
          - "Environment" = "uat"
          - "NAME"        = "sbeacon-backend"
          - "Owner"       = "gaspi"
        } -> null
        # (14 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_modules_layer.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/shared_resources/python-modules/",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/b543027660ad53ae52d1e355a7d853e848201fe0fbf885fd5645831d03449398.zip"
              + runtime       = ""
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/b543027660ad53ae52d1e355a7d853e848201fe0fbf885fd5645831d03449398.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.python_modules_layer.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1641434570792669069" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/9c3c8e0d842f528839ef05201bf321cd86234985f1f4f3162e7b5b3afcbc83c6.zip" -> "builds/b543027660ad53ae52d1e355a7d853e848201fe0fbf885fd5645831d03449398.zip"
          ~ "timestamp" = "1758684130625685000" -> "1758697917867482000"
        }
    }

  # module.sbeacon.module.python_modules_layer.null_resource.archive[0] (deposed object 0759c4d4) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "1370252092250279596" -> null
      - triggers = {
          - "filename"  = "builds/c3f360141f7543f284da3a1da75bf6ad42db5e5b3c29ca337dcb26bf204a7abd.zip"
          - "timestamp" = "1756361686135562000"
        } -> null
    }

  # module.security.module.lambda-sendSecurityAlert.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "4340146740144459520" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758684130767557000" -> "1758697918270420000"
            # (1 unchanged element hidden)
        }
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-dbsnp.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "pgxflow-backend-dbsnp"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:pgxflow_backend_python_modules_layer:14",
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:pgxflow_backend_binaries_layer:10",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "pgxflow-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-dbsnp.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "2654985045950029865" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758684146557715800" -> "1758697930590447000"
            # (1 unchanged element hidden)
        }
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-gnomad.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "pgxflow-backend-gnomad"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:pgxflow_backend_python_modules_layer:14",
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:pgxflow_backend_binaries_layer:10",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "pgxflow-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-gnomad.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "8639167893605562606" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758684146525074000" -> "1758697930275950000"
            # (1 unchanged element hidden)
        }
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-lookup.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/db1824a66f5bca8492b3db281535ed4431efb07f4a4032889484c23cde99cc3c.zip" -> "builds/9934b39ce9810f670883b0ddae38d507e97916558c70f894eab7b3a83ae38927.zip"
        id                             = "pgxflow-backend-lookup"
      ~ last_modified                  = "2025-09-24T04:25:22.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:pgxflow_backend_python_modules_layer:14",
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:pgxflow_backend_binaries_layer:10",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "pgxflow-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-lookup.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "pgxflow/pipeline_lookup/lambda/lookup",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/9934b39ce9810f670883b0ddae38d507e97916558c70f894eab7b3a83ae38927.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/9934b39ce9810f670883b0ddae38d507e97916558c70f894eab7b3a83ae38927.plan.json"
      + id                   = (known after apply)
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-lookup.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "7800733612387065425" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/db1824a66f5bca8492b3db281535ed4431efb07f4a4032889484c23cde99cc3c.zip" -> "builds/9934b39ce9810f670883b0ddae38d507e97916558c70f894eab7b3a83ae38927.zip"
          ~ "timestamp" = "1758684146551382000" -> "1758697930483282000"
        }
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-updateReferenceFiles.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "pgxflow-backend-lookup-updateReferenceFiles"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:pgxflow_backend_python_modules_layer:14",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "pgxflow-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-updateReferenceFiles.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "189444549931881149" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758684146376045000" -> "1758697930371270000"
            # (1 unchanged element hidden)
        }
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-gnomad.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "pgxflow-backend-pharmcat-gnomad"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:pgxflow_backend_python_modules_layer:14",
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:pgxflow_backend_binaries_layer:10",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "pgxflow-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-gnomad.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "2572621044293385217" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758684146768543000" -> "1758697930589081000"
            # (1 unchanged element hidden)
        }
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-gnomad.null_resource.archive[0] (deposed object 2a542534) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "149014663867816729" -> null
      - triggers = {
          - "filename"  = "builds/a928cd25a8d6530207d17e12f0148b7fc2b7557fb65cdb5f1a054735bf0ec4f4.zip"
          - "timestamp" = "1756361703435441000"
        } -> null
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-postprocessor.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "pgxflow-backend-postprocessor"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:pgxflow_backend_python_modules_layer:14",
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:pgxflow_backend_python_libraries_layer:9",
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:pgxflow_backend_binaries_layer:10",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "pgxflow-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-postprocessor.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "8916805434714493207" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758684146732132000" -> "1758697930575795800"
            # (1 unchanged element hidden)
        }
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-postprocessor.null_resource.archive[0] (deposed object 99050145) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "3443380393044919661" -> null
      - triggers = {
          - "filename"  = "builds/8b6fc09523824b0961b9e45bdede7e982e366ee01d4331fd371a0d1e146d97c6.zip"
          - "timestamp" = "1756361703460875000"
        } -> null
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-updateReferenceFiles.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "pgxflow-backend-pharmcat-updateReferenceFiles"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:pgxflow_backend_python_modules_layer:14",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "pgxflow-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-updateReferenceFiles.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "6882072162300187590" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758684146622274000" -> "1758697930799271200"
            # (1 unchanged element hidden)
        }
    }

Plan: 62 to add, 33 to change, 98 to destroy.
╷
│ Error: Error pinging Docker server, please make sure that unix:///var/run/docker.sock is reachable and has a  '_ping' endpoint. Error: permission denied while trying to connect to the Docker daemon socket at unix:///var/run/docker.sock: Head "http://%2Fvar%2Frun%2Fdocker.sock/_ping": dial unix /var/run/docker.sock: connect: permission denied
│ 
│   with provider["registry.terraform.io/kreuzwerker/docker"],
│   on docker.tf line 3, in provider "docker":
│    3: provider "docker" {
│ 
╵
╷
│ Error: Error pinging Docker server, please make sure that unix:///var/run/docker.sock is reachable and has a  '_ping' endpoint. Error: permission denied while trying to connect to the Docker daemon socket at unix:///var/run/docker.sock: Head "http://%2Fvar%2Frun%2Fdocker.sock/_ping": dial unix /var/run/docker.sock: connect: permission denied
│ 
│   with module.sbeacon.provider["registry.terraform.io/kreuzwerker/docker"],
│   on sbeacon/docker_images.tf line 3, in provider "docker":
│    3: provider "docker" {
│ 
╵
❌ Terraform plan creation failed
❌ Terraform plan failed
❌ Main execution failed
ℹ️  ============================================================
ℹ️  SCRIPT EXECUTION SUMMARY
ℹ️  ============================================================
ℹ️  Environment: uat04
ℹ️  Operation: plan
ℹ️  Exit Code: 1
ℹ️  Duration: 1192s
ℹ️  Timestamp: 2025-09-24T07:13:10Z
❌ Deployment failed. Check logs above for details.
ℹ️  Cleaning up sensitive files and configurations
ℹ️  Removing temporary files: *.out
✅ Cleanup completed
❌ Script failed with exit code: 1


```
</details>